class PopupWithImage extends Popup {
    constructor(PopupSelector) {
        super(popupselector)
        this.link
        tjis.name

    }
    open( {
        super.open();
    })
}

// наследуется от Popup, вызывает его конструктор, 
// в который передает нужный параметр - смотреть в сторону super.
// используя логику полиморфизма надо перезаписать метод open, 
// сначала сделать в нем то что описано в ТЗ, 
// а потом вызвать метод родительского класса чтобы открыть попап



// Создайте класс PopupWithImage
// Создайте класс PopupWithImage, который наследует от Popup. 
// Этот класс должен перезаписывать родительский метод open. 
// В методе open класса PopupWithImage нужно вставлять в попап картинку с src изображения и подписью к картинке.